### Introduction: Tidy Data

Before we will dive into the Titanic using the prepared datasets from the Kaggle competition, we will have a look at the concept of "tidy data" and data cleaning.

Starting with prepared datasets is, in a way, cheating big time. Out there in the wild, you will spend your time gathering data

### Titanic

There are 3 contexts here:
   
    - Jupyter notebooks. We touched upon this during the introduction. Kind of a playground, especially suited for computing with data, because one is able to bring together data, code and results (visualisations) in one environment, the notebooks.
    - so-called "Big Data" and data analysis with computers present new possibilities for economic and econometric practice and research.
    - and there is the context of the data we are going to work with: The Titanic disaster. There are various technical ways to look at it. Below there is a link to a computer generated simulation of the actual sinking of the Titanic made by the team of James Cameron.
    
<a href="https://www.youtube.com/watch?v=FSGeskFzE0s">James Cameron: How the Titanic sank</a>

We are going to look at the data about the persons on board with the help of the computer an Python as our programming environment.

### What do we know already?

You probably have seen the movie Titanic (with Kate Winslet and Leonardo DiCaprio, 1997), one of several movies made about the disaster. So you probably know the following:

    - The disaster took place during the night of April 14, 1912 when the ship hit an iceberg
      on her maiden voyage from Southampton (UK) to New York (US) via Cherbourg (FR) and Queenstown (IRE).
    - The loss of lives was 1501 (out of a total of 2207) passengers;
    - There was a shortage of life-boats.

### What do we want to know?

It might well be you have some questions in advance and want to use the data to see if you can find answers, or it could well be you want to play a little bit with the data in order to come up with questions.

Both approaches suggest the following steps:

    - Explore the data (load it, look at it)
    - Clean the data (missing values, splitting columns, etc.)
    - Plot (try to visualize correlations, insights, ...)
    - Assumptions (try to formulate hypotheses, rinse and repeat)

### Explore the data

Mind you we are cheating big time here! We start with existing datasets that allow us to quickly load and explore data, as we will see shortly. Suppose you are a data scientist out in the wild, you will probably get assignments *without* any accompanying datasets. A large proportion of your time will be spend on acquiring data (searching, scraping), cleaning data, combining data from various sources (a lot of tweaking and cleaning).

In [3]:
# Remove warnings
import warnings
warnings.filterwarnings('ignore')
# Set up an environment to be able to explore the data
import pandas as pd
import matplotlib
from matplotlib import pyplot as plt
import numpy as np
%matplotlib inline
matplotlib.style.use('ggplot')
#pd.options.display.max_columns = 100
#pd.options.display.max_rows = 100

Because we have a csv file here, that is a plain text file with each chunk of information separated by a comma, hence csv or "comma separated value" file, we can open up the file in a text editor and look at the contents of our source file:

In [3]:
!aquamacs /Users/peter/Documents/bootcamps/data/titanic/train.csv

/bin/sh: aquamacs: command not found

In [4]:
df_train = pd.read_csv('../data/titanic/train.csv', sep=",")

Now that we have our data in a dataframe (a matrix with columns, variables, that contain various datatypes), we can have quick different looks at the contents using several methods of the dataframe object:

    - head (what is there? shows first five rows of the dataset with the header values if any)
    - info (how many total entries? what are the columns and their types? how many not-null values per column)
    - describe

In [4]:
df_test = pd.read_csv('../data/titanic/test.csv', sep=",")

In [1]:
df_train.head()

NameError: name 'df_train' is not defined

In [6]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [7]:
df_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
# We can select the values of columns using iloc() and the column number (counting from 0)
df_train.iloc[:,1]

0      0
1      1
2      1
3      1
4      0
5      0
6      0
7      0
8      1
9      1
10     1
11     1
12     0
13     0
14     0
15     1
16     0
17     1
18     0
19     1
20     0
21     1
22     1
23     1
24     0
25     1
26     0
27     0
28     1
29     0
      ..
861    0
862    1
863    0
864    0
865    1
866    1
867    0
868    0
869    1
870    0
871    1
872    0
873    0
874    1
875    1
876    0
877    0
878    0
879    1
880    1
881    0
882    0
883    0
884    0
885    0
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

This typical notation with the "dangling comma" is a reminder of the provenance of the Pandas library: R dataframes. Where ,1 denotes a column with all rows and 1, denotes a row with all columns.
Hence the following use of the iloc() method:

In [9]:
df_train.iloc[:1,]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [10]:
# And because iloc[:,1] returns the is the survived column, we can use the label together with the loc() method:
df_train.loc[:,'Survived']

0      0
1      1
2      1
3      1
4      0
5      0
6      0
7      0
8      1
9      1
10     1
11     1
12     0
13     0
14     0
15     1
16     0
17     1
18     0
19     1
20     0
21     1
22     1
23     1
24     0
25     1
26     0
27     0
28     1
29     0
      ..
861    0
862    1
863    0
864    0
865    1
866    1
867    0
868    0
869    1
870    0
871    1
872    0
873    0
874    1
875    1
876    0
877    0
878    0
879    1
880    1
881    0
882    0
883    0
884    0
885    0
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [11]:
# We can slice columns, through the similar kind of subscription we saw when working with lists
# For example, we take the first 10 values of the column survived
# We have the column names as methods in the dataframe object: df.survived[0:10] also works
df_train['Survived'][0:10]

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

We see that the contents of the survived column are floats, which is true, but they actually function as Boolean types: True (1.0) and False (0.0).

Given the simple fact that not many people survived (df.info gives us the number of 486 people registered as survivors? in boats on a total of 1309 passengers = 37% survived?). Who did actually survive and are there relations with age, sex, and travel class?

We can prepare quick sneak previews with slicing data using several columns (note1: we have to pass the columns we are interested in in as a list; note2: selecting the first ten passengers we are looking at first class passengers):

In [12]:
df_train[['Survived','Age','Sex','Pclass']][0:10]

   Survived   Age     Sex  Pclass
0         0  22.0    male       3
1         1  38.0  female       1
2         1  26.0  female       3
3         1  35.0  female       1
4         0  35.0    male       3
5         0   NaN    male       3
6         0  54.0    male       1
7         0   2.0    male       3
8         1  27.0  female       3
9         1  14.0  female       2

Let's have a quick look at the third class. We can use the opposite of the head command (which is aptly called "tail") or we can use a negative slice:

In [13]:
df_train[['Survived','Age','Sex','Pclass']][-10:]

     Survived   Age     Sex  Pclass
881         0  33.0    male       3
882         0  22.0  female       3
883         0  28.0    male       2
884         0  25.0    male       3
885         0  39.0  female       3
886         0  27.0    male       2
887         1  19.0  female       1
888         0   NaN  female       3
889         1  26.0    male       1
890         0  32.0    male       3

Right, we might have something here. Let's get to work.

Correlations: Let's focus on survived in relation to: sex, age, class
Completions: We miss age data (1046 non-null data points) and we might want to factorize this column
Corrections: We might want to drop certain columns, because we are not going to use them for our initial analysis: ticket, cabin, passengerId.

From here we can choose several paths to explore the data a bit more. For example use the crosstab method of a dataframe to make a cross tabulation on gender and survival:

In [14]:
pd.crosstab(df_train.Sex, df_train.Survived)

Survived    0    1
Sex
female     81  233
male      468  109

We can try to do a quick crosstab between survived and age, but this, of course, blows up: To do something sensible with age, we need to clean it up and "factorize" it.

In [15]:
pd.crosstab(df_train.Age, df_train.Survived)

Survived   0   1
Age
0.42       0   1
0.67       0   1
0.75       0   2
0.83       0   2
0.92       0   1
1.00       2   5
2.00       7   3
3.00       1   5
4.00       3   7
5.00       0   4
6.00       1   2
7.00       2   1
8.00       2   2
9.00       6   2
10.00      2   0
11.00      3   1
12.00      0   1
13.00      0   2
14.00      3   3
14.50      1   0
15.00      1   4
16.00     11   6
17.00      7   6
18.00     17   9
19.00     16   9
20.00     12   3
20.50      1   0
21.00     19   5
22.00     16  11
23.00     10   5
...       ..  ..
44.00      6   3
45.00      7   5
45.50      2   0
46.00      3   0
47.00      8   1
48.00      3   6
49.00      2   4
50.00      5   5
51.00      5   2
52.00      3   3
53.00      0   1
54.00      5   3
55.00      1   1
55.50      1   0
56.00      2   2
57.00      2   0
58.00      2   3
59.00      2   0
60.00      2   2
61.00      3   0
62.00      2   2
63.00      0   2
64.00      2   0
65.00      3   0
66.00      1   0
70.00      2   0
70.50      1   0
71.00      2   0
74.00      1   0
80.00      0   1

[88 rows x 2 columns]

In [16]:
# We can use the method unique() to get hold of unique values within a column:
df_train.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

At the beginning we loaded a test set. At random selection from the file "Titanic3.csv", or to be more precise we divided the file into a training set and a test set. What can we learn from the training set in order to predict the survival of the persons from the test set.

Add a column to the test df and fill in with all zeros.

Construct a new dataframe of two columns: PassengerId, Survived

Write that selection to a file.

### Selected bibliography

#### About the RMS Titanic

- Encyclopedia Titanica. Titanic Facts, History and Biography: https://www.encyclopedia-titanica.org/

#### Economics, Machine Learning, and the Titanic

- Bruno S. Frey, David A. Savage, and Benno Torgler, Behavior under Extreme Conditions: The Titanic Disaster, in: Journal of Economic Perspectives, vol. 25, number 1, Winter 2011, pp. 209-222, DOI: http://dx.doi.org/10.1257/jep.25.1.209

- Hal R. Varian, Big Data: New Tricks for Econometrics, in: Journal of Economic Perspectives, vol. 28, number 2, Spring 2014, pp. 3-28 (Titanic, pp. 7-12), DOI: http://dx.doi.org/10.1257/jep.28.2.3

- Sendhil Mullainathan and Jann Spiess, Machine Learning: An Applied Econometric Approach, in: Journal of Economic Perspectives, vol. 31, number 2, Spring 2017, pp. 87-106, DOI: http://dx.doi.org/10.1257/jep.31.2.87

- Francis X. Diebold, All of Machine Learning in One Expression, retrieved from the blog "No Hesitations" (posted: Monday, January 9, 2017) on 20-09-2017 at: https://fxdiebold.blogspot.nl/2017/01/all-of-machine-learning-in-one.html

- Machine learning for Humans

#### Data, statistics, and computing (Python programming language)

- Jake VanderPlas, Python Data Science Handbook. Essential Tools for Working with Data, O'Reilly, 2016, freely available at: https://jakevdp.github.io/PythonDataScienceHandbook/

#### Statistics and computing (R programming language)

- Chester Ismay and Albert Y. Kim, ModernDive. An Introduction to Statitical and Data Sciences via R, 2017, online publication, retrieved on 2017-11-08 at: http://moderndive.com/index.html

- Gareth James, Daniela Witten, Trevor Hastie, and Robert Tibshirani, An Introduction to Statistical Learning with Applications in R, New York, Springer Science and Business Media, 2013, http://www-bcf.usc.edu/~gareth/ISL/index.html Python code for some chapters of the book can be found here: https://github.com/JWarmenhoven/ISLR-python)

- Trevor Hastie, Robert Tibshirani, and J. Friedman, Elements of Statistical Learning, 2nd ed., New York, Springer Science and Business Media, 2009, http://statweb.stanford.edu/~tibs/ElemStatLearn/

#### Tidy Data (Hadley Wickham, R programming language)

- Hadley Wickham, Tidy Data, in: Journal of Statistical Software, August 2014, Vol. 59, issue 10, https://www.jstatsoft.org/article/view/v059i10/v59i10.pdf. Supplementary material (datasets and R code) available on GitHub: https://github.com/hadley/tidy-data.

- Hadley Wickham and Garrett Grolemund, R for Data Science. Visualize, Model, Transform, and Import Data, O'Reilly, 2017. Online version freely available: http://r4ds.had.co.nz/

- Tidyverse R library, retrieved from: https://www.tidyverse.org/ [R packages for data science]

#### Download Anaconda Distribution

- https://www.anaconda.com/download/

#### Jupyter Notebook

- http://jupyter.org